[
    {
        "paragraph_id": 1,
        "text": "DECISION № 12Sofia, 22 May 2001 constitutional case № 12/2001 Judge-Rapporteur Todor Todorov (Promulgated, SG No. 50 of 1 June 2001)",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "CASE TITLE"
    },
    {
        "paragraph_id": 2,
        "text": "Statute: Hristo Danov - President, Members: Georgi Markov, Dimitar Gochev, Todor Todorov - rapporteur, Nedelcho Beronov, Stefanka Stoyanova, Margarita Zlatareva, Vasil Gotsev, Lyudmil Neykov, Rumen Yankov, Zhivan Belchev, Penka Tomcheva",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "JUDGES"
    },
    {
        "paragraph_id": 3,
        "text": "The case was initiated at the request of the Prosecutor General. The request maintains that the provision of Article 53, paragraph 1 of the Law on the Election of Members of Parliament (ZINP - SG, issue 37 of 2001) contradicts the Constitution.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 4,
        "text": "The disputed norm states that \"During the election campaign, the registered candidates for MPs and advocates may not be detained and prosecuted except in cases of a serious crime.\"",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "DISPUTE"
    },
    {
        "paragraph_id": 5,
        "text": "According to the request, the provision of Article 53, paragraph 1 of the ZINP contradicts of the constitutional principle for equality of the citizens - art. 6, para 2 of the Constitution.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "DISPUTE"
    },
    {
        "paragraph_id": 6,
        "text": "It is alleged that both the general rule (Article 6, paragraph 2) and the exceptions to it in the field of criminal law are defined at the constitutional level. Immunity cannot be introduced by law.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "DISPUTE"
    },
    {
        "paragraph_id": 7,
        "text": "By order of 3 May 2001, the Constitutional Court granted the request for examination on the merits and constituted the President, the Council of Ministers, the Minister of Justice, the Supreme Court of Cassation, the Supreme Administrative Court as interested parties. The Central Election Commission, the Supreme Bar Council, the Bulgarian Association for Fair Elections, the Civil Initiative for Free and Democratic Elections Association, the Bulgarian Human Rights Advocates, the Bulgarian Helsinki Committee and the Association for European Integration and Human Rights",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERESTED PARTIES"
    },
    {
        "paragraph_id": 8,
        "text": "The challenged norm is supported by the Supreme Court of Cassation, the Supreme Bar Council, and by the Association for European Integration and Human Rights - only regarding the advocates.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "CHALLENGING PARTIES"
    },
    {
        "paragraph_id": 9,
        "text": "According to the opinions presented by the Council of Ministers and Bulgarian human rights lawyers, the disputed norm complies with the Constitution.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "DISPUTE"
    },
    {
        "paragraph_id": 10,
        "text": "To be rejected The Constitutional Court, after discussing the disputed provision, fully shares the considerations set out in the opinion of the Council of Ministers, namely: 1. Clarifying the compliance of Article 53, paragraph 1 of the Law on Public Procurement with the Constitution, as follows from the request of the Prosecutor General, implies an answer to two main questions: - whether Article 53, paragraph 1 of the Law on Public Procurement creates privileges for individual citizens based on someone of the signs specified in Art. 6, para 2 of the Constitution - whether the Constitution, regulating restrictions in the criminal liability of persons holding certain positions (Art. 69 and Art. 70, Art. 103, para 1 and 4, Art. .132, para 2 and Article 147, para 6) excludes the possibility for such regulation in relation to other persons to be contained in law. ",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 11,
        "text": "2. As stated in the reasons of Decision № 14 of the Constitutional Court of 1992 on constitutional case № 14 of 1992 (SG, issue 93 of 1992), equality before the law means equality of all citizens before the normative acts and obligation for their equal treatment by the state authorities.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 12,
        "text": "Article 6, paragraph 2 of the Constitution prohibits the restriction of rights or the creation of privileges based on race, nationality, ethnicity, sex, origin, religion, education, beliefs, political affiliation, personal and social status or property status.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 13,
        "text": "According to the same decision of the Constitutional Court, the signs for non-admission of restrictions of the rights or granting of privileges, specified in art. 6, para 2 are listed exhaustively.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 14,
        "text": "3. It is not clear from the request which of the features under Article 6, paragraph 2 of the Constitution is the basis of the privilege under Article 53, paragraph 1 of the Law on Public Procurement.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 15,
        "text": "The special status of the persons registered for participation in the elections as candidates for Members of Parliament and of their deputies is not a privilege of a separate group of citizens, based on some of the features specified in Article 6, paragraph 2 of the Constitution, but is established for ensuring the free exercise of the right of citizens to vote and to be elected.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 16,
        "text": "The position of a candidate for Member of Parliament or Advocate does not depend on any of the features specified in Article 6, paragraph 2 of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "APPLICATION OF EXISTING LAW"
    },
    {
        "paragraph_id": 17,
        "text": "Any person, regardless of his or her race, nationality, ethnicity, sex, origin, religion, education, beliefs, political affiliation, personal and social status or property status, may register as a candidate for MP or Advocate. It is enough for it to meet the conditions required by the Constitution and the laws of the country.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 18,
        "text": "The status of a candidate for a Member of the National Assembly or of his / her representative does not require the presence of a certain attribute, specified in Art. There is no constitutional prohibition on restricting the rights or granting privileges on other grounds than those exhaustively listed in Article 6, paragraph 2 of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "CONDITIONS CANDIDATE REGISTRATION"
    },
    {
        "paragraph_id": 19,
        "text": "The reasons for the above-mentioned decision of the Constitutional Court state: \"From these and other cases explicitly mentioned in the Constitution, it is evident that restrictions on the rights and granting of privileges to certain social groups are permissible under the Constitution. However, it must be emphasized that in all these cases it is a matter of socially necessary restrictions on the rights or granting of privileges to certain groups of citizens while maintaining the priority of the principle of equality of all citizens before the law. The precise and comprehensive indication of the social characteristics which justify the non-restriction of rights and the granting of privileges is a guarantee against unjustified extension of the grounds for the admission of restrictions on the rights of citizens or privileges.\"",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 20,
        "text": "5. It is indisputable that in the specific case the regulation in art. 53, para 1 ZINP is socially necessary.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "NECESSITY OF LAW"
    },
    {
        "paragraph_id": 21,
        "text": "It is a guarantee for the free exercise of active and passive suffrage.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "NECESSITY OF LAW"
    },
    {
        "paragraph_id": 22,
        "text": "The election campaign begins 30 days before and ends 24 hours before election day (Article 54 of the Law on Elections).",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 23,
        "text": "The term is short, clearly defined and in view of the provision of art. 64, para 3 of the Constitution this period cannot be arbitrarily extended by the legislator.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "JUSTIFICATION OF EXISTING LAW"
    },
    {
        "paragraph_id": 24,
        "text": "Candidates for MPs and their deputies have the opportunity to prepare their participation in the elections and to conduct pre-election campaigning only during this period and within its framework they do not have the necessary time to defend themselves against unfounded accusations.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 25,
        "text": "The initiation of criminal proceedings or the detention of a candidate or Member of Parliament will irreparably infringe on their rights, as it may frustrate their participation in the elections, impede the election of the candidate and affect the election results by discrediting the voters both the candidate for MP and the political force he represents.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SOCIAL/POLITICAL NEED FOR lAW"
    },
    {
        "paragraph_id": 26,
        "text": "Even if the criminal proceedings are terminated and the charges are dropped, this will not lead to a change in the election results and will not restore the voter vote as it really would.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SOCIAL/POLITICAL NEED FOR LAW"
    },
    {
        "paragraph_id": 27,
        "text": "The likelihood of such a hypothesis in the process of forming the legislature determines the right of the legislator to take measures to prevent external factors and circumstances to influence the free exercise of suffrage and as a consequence to lead to a change in the election results.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "JUSTIFICATION"
    },
    {
        "paragraph_id": 28,
        "text": "6. The perception of the above gives grounds to conclude that Article 53, paragraph 1 of the Law on Public Procurement does not contradict Article 6, paragraph 2 of the Constitution, as, on the one hand, it does not establish a privilege based on any of the features specified in the text, and on the other hand, insofar as a privilege is established, it is socially necessary.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SOCIAL/POLITICAL NEED FOR LAW"
    },
    {
        "paragraph_id": 29,
        "text": "7. From the systematic place of the texts in the Constitution, which establish restrictions in the criminal liability of persons holding certain positions, it can be concluded that they do not exhaust the constitutionally admissible possibilities for limiting the criminal liability.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 30,
        "text": "The regulation of these restrictions is contained in the Constitution, as they are part of the statute of the respective body regulated in the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 2,
        "description": "LEGAL BASIS IN CONSTITUTION"
    },
    {
        "paragraph_id": 31,
        "text": "This conclusion is supported by the fact that, in principle, the overall regulation of the conditions for the emergence of criminal liability and the procedure for its implementation, including the matter of criminally responsible persons and hypotheses of release from criminal liability, is contained in legislation - Criminal Code and Criminal Procedure Code. In the Constitution, criminal irresponsibility and criminal inviolability are not regulated in general, in a general way as a separate legal institution, but refer only to certain persons.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SUPPORT FOR CONCLUSION"
    },
    {
        "paragraph_id": 32,
        "text": "The provisions of Art. 69 and Art. 70, Art. 103, para 1 and 4 and Art. 132, para 1, and Art. 147, para. 6 of the Constitution regulate this issue separately for the Members of Parliament, the President and the Vice-President, the judges, the prosecutors and the investigators and the constitutional judges.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 33,
        "text": "The constitutional principle of equality of citizens is regulated in Article 6, paragraph 2 of the Constitution, included in Chapter One - Basic Principles.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL BASIS"
    },
    {
        "paragraph_id": 34,
        "text": "The constitutional obligation to hand over to anyone accused of a crime the judiciary is in Article 31, paragraph 1, included in Chapter Two - Fundamental Rights and Obligations of Citizens.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL BASIS"
    },
    {
        "paragraph_id": 35,
        "text": "And the regulation, which establishes restrictions in the criminal liability for persons holding certain positions, is not in Chapter One as a constitutionally regulated exception to the general principle of Art. 6, para 2 (regardless of the sign on which it is established), nor is it in Chapter Two as a constitutionally regulated exception from Art. 31, para 1.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LIMITATIONS"
    },
    {
        "paragraph_id": 36,
        "text": "The regulation is not unified and summarized as a separate legal institute, but is included in Chapter Three - National Assembly, Chapter Four - President of the Republic, Chapter Six - Judiciary and Chapter Eight - Constitutional Court.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "PRESENCE IN CONSTITUTION"
    },
    {
        "paragraph_id": 37,
        "text": "In this situation, the interpretation of the constitutional texts in view of their systematic place imposes the conclusion that they do not aim to regulate exhaustively the cases of criminal irresponsibility and criminal inviolability, but refer only to private cases within the status of the respective state bodies.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "INTENTION OF LAW"
    },
    {
        "paragraph_id": 38,
        "text": "This means that there is no prohibition by law to regulate criminal inviolability in other cases not mentioned in the Constitution, unless this is contrary to constitutional principles.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 39,
        "text": "8. The Constitutional Court finds it necessary to pay attention to the circumstance that the norm of Art. 53, para 1 of the Law on Public Procurement treats the issue only of criminal inviolability.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 40,
        "text": "It does not regulate the granting of \"immunity\" in the true sense, understood as criminal irresponsibility.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 41,
        "text": "In its practice so far, the court has taken a stand on these issues in a number of decisions - Decision № 10 of 27 July 1992 on c.d. № 13/92 (SG, issue 63 of 1992), Decision № 2 of 18 February 1993 under c.d. № 36/92 (SG, issue 16 of 1993), Decision № 4 of 17 May 1995 under c.d. № 2/95 (SG, issue 62 of 1995).",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 42,
        "text": "In these decisions, the court uses the general concept of \"immunity\", combining the issues of criminal irresponsibility with the issues of criminal inviolability.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 43,
        "text": "In all these cases, however, the merger applies only to constitutionally established immunities.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 44,
        "text": "The admissibility of establishing criminal immunity by law in favor of persons other than those specified by the Constitution has not been discussed.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 45,
        "text": "9. The court held that decision № 3 of 7 March 1998 under c.d. № 1/98 (SG, issue 29 of 1998) treats only the issue of criminal irresponsibility.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 46,
        "text": "In it, the provision of Art. 206, para. 2 of the Ministry of Interior, according to which officers and sergeants from the Ministry of Interior cannot be investigated and detained without the permission of the Minister of Interior.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 47,
        "text": "The norm in question creates conditions for indefinite blocking of the possibility for criminal prosecution, including for serious crimes, which is essentially criminal irresponsibility.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PREVIOUS CASES"
    },
    {
        "paragraph_id": 48,
        "text": "Therefore, the cited decision is irrelevant to the issues of criminal inviolability, which in its essence and function differs significantly from criminal irresponsibility.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 49,
        "text": "10. The court takes into account the difference between criminal irresponsibility and criminal inviolability.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING LEGAL TERMS"
    },
    {
        "paragraph_id": 50,
        "text": "Unlike criminal irresponsibility, criminal inviolability is purely procedural in nature.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING LEGAL TERMS"
    },
    {
        "paragraph_id": 51,
        "text": "It is always urgent and does not exclude the responsibility of the persons for crimes committed by them, but only postpones it.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING LEGAL TERMS"
    },
    {
        "paragraph_id": 52,
        "text": "Insofar as the provision of Art. 53, para 1 ZINP grants the candidates for Members of Parliament and the advocates criminal immunity only for the term of the election campaign, the court does not find grounds for declaring it unconstitutional.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "IRRESPONSIBILITY VS INVIOLABILITY"
    },
    {
        "paragraph_id": 53,
        "text": "11. The court, in accordance with what has been said so far, does not find a contradiction between Article 31, paragraph 1 of the Constitution and Article 53, paragraph 1 of the Law on Public Procurement.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "JUSTIFICATION"
    },
    {
        "paragraph_id": 54,
        "text": "According to the constitutional text, anyone accused of a crime must be handed over to the judiciary within the legally prescribed time limit.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "JUSTIFICATION"
    },
    {
        "paragraph_id": 55,
        "text": "In this case, Article 53, paragraph 1 of the Law on Public Procurement, by introducing criminal inviolability of the candidates registered for participation in the parliamentary elections and their representatives during the election campaign, sets another, also legal term, although different from the general one, for their transfer to the judiciary.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 56,
        "text": "Therefore, the text does not block the possibility of instituting criminal proceedings and does not preclude the exercise of criminal liability.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 57,
        "text": "12. That is why the court accepts that the granting of criminal immunity to the candidates for MPs and their deputies during the election campaign is not a privilege based on a feature specified in Article 6, paragraph 2 of the Constitution and there is no contradiction between Article 53. , para 1 ZINP or other constitutional principle.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "JUSTIFICATION"
    },
    {
        "paragraph_id": 58,
        "text": "Therefore, the provision of Art. 53, para 1 ZINP does not contradict the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "JUSTIFICATION"
    },
    {
        "paragraph_id": 59,
        "text": "Based on the above and on the grounds of Art. 149, para 1, item 2 of the Constitution, the court RESOLVES: Rejects the request of the Prosecutor General to declare it unconstitutional the provision of Art. 53, para 1 of the Law on Election of Members of Parliament (SG, issue 37 of 2001).",
        "label": "DECISION",
        "label_id": 5,
        "description": "CASE RESOLVED"
    }
]
