[
    {
        "paragraph_id": 1,
        "text": "Solution . 14 of 12 September 1995 under c.d. . 23/95 for interpretation of the provision of art. 106 of the Constitution in its part, in which the Council of Ministers has been given the power to organize the management of state property (Promulgated, SG No. 85 of September 22, 1995)",
        "label": "BACKGROUND",
        "label_id": 0
    },
    {
        "paragraph_id": 2,
        "text": "Members: Asen Manov - Chairman, Mladen Danailov, Milcho Kostov, Tsanko Hadjistoychev, Stanislav Dimitrov, Nikolay Pavlov, Dimitar Gochev, Ivan Grigorov, Todor Todorov, Alexander Arabadjiev - rapporteur, Georgi Markov",
        "label": "BACKGROUND",
        "label_id": 0
    },
    {
        "paragraph_id": 3,
        "text": "The case was instituted at the request of the President of the Republic on 7 August 1995 giving a mandatory interpretation of the provision of Article 106 of the Constitution c the part in which the Council of Ministers is given the authority to organizes the management of state property.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 4,
        "text": "In the circumstantial part At the request, the exercise of this power by the Government is placed in the context of its scope as well as the principle of separation of powers, proclaimed in Article 8 of the Constitution.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 5,
        "text": "It is pointed out that the disposition of state property and in particular with a building stock by the Council of Ministers no may impair the material preconditions for carrying out the activity of authorities of individual authorities and thus to influence their independence.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 6,
        "text": "By order of 8 August 1995, the application was granted for consideration, such as the subject-matter of the interpretation is worded in the light of the connection between the provision of Article 106 with Article 8 of the Constitution: regarding the power of the Council of Ministers to organizes the management of state property and the consequences of the exercise of this power over material conditions and preconditions for the functioning of individual authorities.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 7,
        "text": "With the same definition as interested parties in the case are constituted The National Assembly, the Council of Ministers, the Supreme Court and the Prosecutor General, who have been given an appropriate period to submit a written opinion; and evidence.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 8,
        "text": "Pursuant to the provision provided to them by the Constitutional Court the possibility for written opinions on the case was expressed by the National Assembly, The Council of Ministers and the Prosecutor General.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 9,
        "text": "The opinion of the National Assembly, signed by its chairman, reads maintains that there is no need for a new interpretation in the light of what has already been stated by The Constitutional Court decision . 19 of 21 December 1993 on constitutional case . 11 of 1993, which gave an interpretation of the provision of Article 106 of The Constitution.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 10,
        "text": "In the case of acceptance of the request for consideration on the merits takes the view that the Council of Ministers organizes the management of all state property and in exercising the power under Article 106 of The Constitution is not limited by which state organizations and by the system of which power - legislative, executive or judicial - are state property provided for management.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 11,
        "text": "It is argued that the thesis, according to which the management of state property may have limits, and that no it can extend beyond the scope of the executive, in and of itself contradicts the principle of separation of powers.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 12,
        "text": "At the same time, it is noted that the acts of order by the Council of Ministers which set one authority depending on the will of another, subject to judicial review as individual administrative acts and their annulment may be requested due to contradiction with Article 8 of the Constitution.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 13,
        "text": "The opinion of the Council of Ministers sets out detailed considerations for inadmissibility of the request according to art. 21, para 5 of the Law on the Constitutional Court (ZKS), maintaining that the Constitutional Court has ruled on the same subject with decision . 19 of 21 December 1993 under c.d. . 11/93.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 14,
        "text": "It is emphasized that that the property provided to public authorities for the implementation of their functions are public property and it is the government competently - by virtue of Article 106 of the Constitution and in the absence of legal regulation at the legal level - to determine the procedure for their provision, management and redistribution.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 15,
        "text": "Limiting this constitutionally authority of the Council of Ministers, including by giving a mandatory interpretation of the Constitution in this sense by the Constitutional Court, bi constitutes in fact a violation of the principle laid down in Article 8 of the basic law.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 16,
        "text": "The opinion of the Prosecutor General developed the thesis that the power of The Council of Ministers under Article 106 of the Constitution is not equivalent to the power of the owner of a particular property, and that this function of the government cannot be considered on its own, but always in its relationship with other principles established in the Constitution, such as the principles for separation of powers and their independence (Article 8 and Article 117, paragraph 2).",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 17,
        "text": "Is supported the understanding that as a supreme executive body the Council of Ministers determines the procedure for the management of the property used by the executive power, but the same does not apply to property managed by the other two authorities - legislative and judicial, because the recognition of such a power is equivalent to having managerial functions over them, which would be contrary to the stated constitutional principles.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 18,
        "text": "It is noted that in in all cases the competence in question of the Council of Ministers cannot be exercises against the interests and without the consent of the other authorities, resp. institutions.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 19,
        "text": "Before setting out what was taken as outlined in the definition of admissibility of the request subject to interpretation, the Constitutional Court finds it necessary to draw attention to the fact that this definition is taken into account the decision . 19 of 21 December 1993 under c.d. . 11/93, p which is given an interpretation of the provision of Article 106 of the Constitution in its part on the power of the Council of Ministers to organize the management of state property.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 20,
        "text": "There is no doubt that the Constitutional Court has ruled at the request for giving a mandatory interpretation of the provision of Article 106 of The Constitution on the powers of the Council of Ministers to organize the management of state property.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 21,
        "text": "There are no, on the other hand, grounds, s in order for the court to deviate from the interpretation given by this judgment, or yes complements it in terms of its specific subject content.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 22,
        "text": "At the same time, the request of the President of the Republic, on the basis of which it is initiated the case, contains in its circumstantial part issues which raises the question of the exercise by the government of the intended authority to another plane.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 23,
        "text": "This is the plane on which they develop the relations between the separate authorities, resp. constitutionally established organs.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 24,
        "text": "This is the essence of the new request or his specifics, as noted in the definition of August 8 this year. It follows from it the admissibility of the request.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 25,
        "text": "That is why the Constitutional Court accepts that it exists a new, separate subject of interpretation on which it may exercise its power under Art. 149, para 1, item 2 of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 26,
        "text": "In relation to the subject of interpretation the conditions of art. 21, para 5 ZKS for inadmissibility of the request are not present and the court finds no grounds for reconsideration of the admissibility of the conditions of art. 25, para 2 PODKS.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 27,
        "text": "In order to rule on the subject matter of the order of 8 August 1995 interpretation, the Constitutional Court accepts the following: 1. In exercising its power under Article 106 of the Constitution, yes organizes the management of state property by the Council of Ministers performs dispositional actions with properties - public state property, which are used by state institutions outside the executive system power.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 28,
        "text": "Dispositional actions should be understood in view of the subject matter of the interpretation of those managerial actions dressed in the form of appropriate acts by which objects of public state property are provided, distribute, redistribute, etc. of various state bodies.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 29,
        "text": "When such actions of the government affect others, constitutionally established bodies, such as the President, the National Assembly, the bodies of the judiciary, the Constitutional Court, the exercise of this power performed in relation to subjects with constitutional status, which is determined by their competence established by the Constitution.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 30,
        "text": "2. The very proclamation of the principle of separation of powers in Article 8 of The Constitution, as well as the establishment by it of other bodies that implement the important functions of a head of state and constitutional review, presuppose the institution-building and existence of these bodies.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 31,
        "text": "A material prerequisite for this is the provision of appropriate conditions, c which in practice the activity of the respective bodies is carried out.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 32,
        "text": "When the creation of these conditions, as well as their possible change is it is necessary to take into account the independence, representativeness and the importance of these institutions.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 33,
        "text": "This follows from the constitutional position of these bodies and is a requirement that may be justified by the place and competence of the Constitution determined by the Constitution every one of them.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 34,
        "text": "The system of supreme state bodies created by the Constitution includes The National Assembly as a body that exercises legislative power and exercises parliamentary control. It elects and dismisses the Prime Minister, and upon his proposal - the Council of Ministers and performs changes in government.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 35,
        "text": "The President of the Republic is the head of state of country and has important functions in the procedure of forming a government.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 36,
        "text": "The judiciary protects the rights and legitimate interests of citizens, legal entities and the state, including through implementation of control for legality over the acts of the administration.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 37,
        "text": "The Constitutional Court ensures the supremacy of the Constitution by giving mandatory interpretations and exercises control over the constitutionality of laws and the other acts of the National Assembly, as well as the acts of the President.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 38,
        "text": "3. This general remark on the basic functions of the constitutional established bodies shows that they enjoy a constitutional status, which cannot be harmed not only by interference and obedience that would constituted an immediate violation of the basic principle of Article 8 of Constitution, but also by affecting their prestige and dignity in a way that does not directly concern the performance of their functions.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 39,
        "text": "Moreover, the interpretation question under consideration presupposes not only the final one a case in which an institution may be deprived of the opportunity to it exists and functions for reasons of a completely material nature.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 40,
        "text": "There is also hypotheses in which the activity of a given body is hindered or the authorization is not corresponds to its constitutional position. In any case similar approach is inadmissible because it contradicts the findings of The Constitution places the relevant body in the system of supreme state bodies and the resulting autonomy and dignity of these bodies.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 41,
        "text": "On an even greater basis, such an act of the government enters directly contradiction with the Constitution, when the difficulties created by material and practical nature of the functioning of a body result making it dependent on another.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 42,
        "text": "In this case, as noted in the opinion of the National Assembly, the administrative act of the Minister council undoubtedly contradicts Article 8 of the Constitution and on this basis may to request its annulment in accordance with the procedure established by law.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 43,
        "text": "The very opportunity to The exercise of legality control over such an act also derives from the principles established in the Constitution for relations between the authorities and f another indication that these relationships, including when develop entirely on a practical level, are subject to the requirements of The Constitution.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 44,
        "text": "4. For these reasons, the Constitutional Court finds that in order to be in agreement with the stated constitutional requirements, the administrative actions of government when they concern sites related to the needs of others, constitutionally established bodies cannot be justified solely by considerations of expediency.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 45,
        "text": "Such considerations are typical in the exercise of the activity under organizing the management of state property, which is initially clean administrative. In the context of relations with other higher state however, they cannot be the only and decisive authorities.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 46,
        "text": "The one-sided issuance of administrative acts through which this activity is carried out, creates conditions for ignoring the constitutional prestige of others higher state bodies and until its damage.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 47,
        "text": "Immediate consequence of these are the difficulties, and even the possible practical impossibility of the functioning of a body or placing it in a position which it does not corresponds to its constitutional status.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 48,
        "text": "Therefore, to thwart the occurrence of such unwanted and inadmissible by Constitution consequences, it is necessary the issuance of such acts to take place in the conditions of coherence with the institutions concerned.",
        "label": "POLITICAL",
        "label_id": 4
    },
    {
        "paragraph_id": 49,
        "text": "This stems from the principles established in the Constitution for the relationship between the individuals authorities, respectively between the bodies established in the Constitution. Thus the activity and respect of these bodies as bearers of competence granted to them by the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 50,
        "text": "On the basis of the above and on the grounds of Art. 149, para 1, item 1 of the Constitution The Constitutional Court RESOLVED:The Council of Ministers organizes the management of state property under Article 106 of the Constitution in a way that is in accordance with the hierarchy and competence of state bodies and does not impair their prestige.",
        "label": "DECISION",
        "label_id": 5
    },
    {
        "paragraph_id": 51,
        "text": "When the exercise of this power he may not impede the activities of constitutionally established bodies such as the President, the National Assembly, the judiciary and the Constitutional Court.",
        "label": "DECISION",
        "label_id": 5
    },
    {
        "paragraph_id": 52,
        "text": "The Council of Ministers cannot dispose of state property in which accommodate the specified state institutions by issuing unilateral acts on appropriateness except with their express consent.",
        "label": "DECISION",
        "label_id": 5
    }
]
