[
    {
        "paragraph_id": 1,
        "text": "Solution Ne 17 of 24 November 1992 under c.d. Ne 22/92 on a request to declare the decision unconstitutional of the National Assembly of 15 July 1992 on the request for granting the status of higher school of the so-called \"Varna Free University\" (Promulgated, SG No. 98 of December 4, 1992)",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "CASE TITLE"
    },
    {
        "paragraph_id": 2,
        "text": "Members: Chairman - Asen Manov, Mladen Danailov, Milcho Kostov, Tsanko Hadjistoychev, Stanislav Dimitrov, Neno Nenovski - Rapporteur, Nikolay Pavlov, Teodor Chipev, Milena Zhabinska, Lyuben Kornezov, Pencho Penev, Alexander Arabadzhiev",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "CASE TITLE"
    },
    {
        "paragraph_id": 3,
        "text": "The case was initiated at the request of 50 MPs from the 36th National Assembly assembly of July 31, 1992.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 4,
        "text": "The Constitutional Court is requested on the grounds of Art. 149, para. 1, item 2 of the Constitution to establish the unconstitutionality of the decision of The National Assembly of 15 July 1992 on the request for granting the status of a higher education institution school of the so-called Varna Free University (SG, issue 59/1992).",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 5,
        "text": "By order of 29 September 1992, the Constitutional Court constituted as parties to the case the National Assembly, the Council of Ministers, the Ministry of Education and Science, Association \"Science and Business\" - Varna, and Varna free university.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERESTED PARTIES"
    },
    {
        "paragraph_id": 6,
        "text": "By order of 27 October 1992, the court ruled that admissible request and enable the parties to submit written submissions opinions and evidence.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERESTED PARTIES"
    },
    {
        "paragraph_id": 7,
        "text": "Opinions were submitted in support of the request Science and Business Association and Varna Free University.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERESTED PARTIES"
    },
    {
        "paragraph_id": 8,
        "text": "Association Science and Business also provided written evidence of the creation, the organization and activity of the Free University in Varna.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERESTED PARTIES"
    },
    {
        "paragraph_id": 9,
        "text": "Like The transcript of the 108th meeting of The National Assembly of July 15, 1992 In view of the considerations set out in the request and in the opinions and the considerations gathered evidence in the case The Constitutional Court accepts the following: In the first place as a ground for declaring the unconstitutionality of the decision of the National Assembly the authors of the request point out the lack of quorum for its taking, which violates Art. 81, para. 1 of the Constitution. For The transcript of the sitting of the National Assembly, ¢ which documented the vote of 120 MPs. It is said that less than 80 MPs attended the sitting.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP POSITIONS"
    },
    {
        "paragraph_id": 10,
        "text": "However, it is established from the transcript of the sitting of the National Assembly something else. The meeting started with a quorum, which was certified expressly.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP POSITIONS"
    },
    {
        "paragraph_id": 11,
        "text": "Not once in the course of the meeting was there any doubt that there was none quorum. Such doubt was not expressed even before the vote of the contested decision to conduct a census of those present at the meeting MPs, as provided by Art. 36, para. 2 of the Regulations for the organization and the activity of the National Assembly.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP POSITIONS"
    },
    {
        "paragraph_id": 12,
        "text": "The transcript also shows that after the vote the adoption of a decision on the so-called Varna Free University, which was also not questioned from no one. The claim that less than 80 people were present representatives has not been proven.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP POSITIONS"
    },
    {
        "paragraph_id": 13,
        "text": "The transcript is an official document of The National Assembly has probative value in this case. Legally relevant a finding as to the presence or absence of a quorum may only be made The National Assembly, which is reflected in the minutes of its sitting.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 14,
        "text": "The decision of the National Assembly is challenged from the point of view of competence of the National Assembly, in two directions. First, the petitioners find that the National Assembly has violated the principle of separation of powers (Article 8 of the Constitution) - has entered the sphere of the judiciary, questioning the legality of the registration of the Association \"Science and Business\" with its statute, which provides for it to forms Varna Free University.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 15,
        "text": "This argument is unfounded. The National Assembly has acted in accordance with its competence under Art. 2, para. 1 of the Higher Education Act (HEA) as amended in 1990. It is not ruled on the issue of registration of the Science and Business Association.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "INTERPRETATION OF LAW REGARDING DECISION"
    },
    {
        "paragraph_id": 16,
        "text": "The motives of the decision of the National Assembly, according to which the association is established Varna Free University in violation of current laws, refer to infringements of provisions not on registration but on the establishment of a higher education institution. The creation (in the legal sense of the word) of such an educational institution is not within the competence of the association.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "INTERPRETATION OF LAW REGARDING DECISION"
    },
    {
        "paragraph_id": 17,
        "text": "The state exercises control over all types and degrees of schools (Art. 53, para. 6 of the Constitution), and as for the higher schools, the control at their creation was submitted to the National Assembly.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "STATE ROLE OF EDUCATION"
    },
    {
        "paragraph_id": 18,
        "text": "The National Assembly is not discussed and did not resolve any issue other than the issue of granting higher status school of Varna Free University, ie has not left competence.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "NATIONAL ASSEMBLY ROLE"
    },
    {
        "paragraph_id": 19,
        "text": "Second, it is maintained that in making its decision the National Assembly is acted outside the limits of its main functions under Art. 62 of the Constitution and of those defined in Art. 84 and 85 of the Constitution powers.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 20,
        "text": "However, it is omitted given that the powers of the National Assembly have not been formulated exhaustively in Art. 84 and 85. They are partly contained in other constitutional ones provisions.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LIMITS OF NATIONAL ASSEMBLY'S ROLE"
    },
    {
        "paragraph_id":  21,
        "text": "The Constitution does not exclude the possibility of separate powers of The National Assembly to be specified by law.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "INTERPRETATION OF SEPARATION OF POWERS"
    },
    {
        "paragraph_id": 22,
        "text": "Besides, it's obvious that not all powers of the National Assembly are related to its legislative function and with its function to exercise parliamentary control. Such authority is provided in Art. 2, para. 1 ZVO.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "INTERPRETATION OF SEPARATION OF POWERS"
    },
    {
        "paragraph_id": 23,
        "text": "The allegation of a violation of Art. 19, para. 2 of The Constitution, according to which the law creates and guarantees to all citizens and legal entities equal legal conditions for economic activity, such as prevents the abuse of monopoly, unfair competition and protects consumer.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SCOPE OF CONSTITUTIONAL LAW"
    },
    {
        "paragraph_id": 24,
        "text": "The scope of this provision is not the field of education, to which the decision of the National Assembly directly refers.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SCOPE OF PROVISION"
    },
    {
       "paragraph_id": 25,
        "text": "Only parliament can make assessments of expediency.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "PARLIAMENT'S ROLE"
    },
    {
        "paragraph_id": 26,
        "text": "Its applied field is the sphere of economic activity. Therefore, the reference to Art. 19, para. 2 is not appropriate.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SCOPE OF CONSTITUTIONAL LAW"
    },
    {
        "paragraph_id": 27,
        "text": "The Constitutional Court cannot discuss the criteria for expediency by which the parliament is guided when granting the status of a higher education institution school, in each case.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "THE ROLE OF THE COURT"
    },
    {
        "paragraph_id": 28,
        "text": "Only parliament can make assessments of expediency.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "SCOPE OF CONSTITUTIONAL LAW"
    },
    {
        "paragraph_id": 29,
        "text": "The Constitutional Court also finds the complaint that the disputed is unfounded decision violates Art. 53, para. 5 of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 30,
        "text": "The creation of non-state schools and education in them is subject to state control.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "STATE ROLE IN EDUCATION"
    },
    {
        "paragraph_id": 31,
        "text": "By With regard to higher education, it is now exercised by the National Assembly under the force of art. 53, para. 5 and 6 of the Constitution in connection with Art. 2, para. 1 ZVO.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "STATE ROLE IN EDUCATION"
    },
    {
        "paragraph_id": 32,
        "text": "The provision of Art. 2, para. | of the Higher Education Act must be interpreted in connection with Art. 53, para. 5 and 6 of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 33,
        "text": "After the National Assembly is authorized to legalize public higher education institutions, it is competent to do the same with respect to non-state.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 34,
        "text": "The very provision of Art. 2, para. | ZVO is not unconstitutional, as alleged in the request, although it could be considered whether it is it is expedient for the National Assembly to exercise such competence.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "MORAL/POLITICAL JUDGEMENT OF NATIONAL ASSEMBLY DECISION"
    },
    {
        "paragraph_id": 35,
        "text": "The authors of the request and the opinions allege infringements of internal organizational rules in the preparation of the decision of the People's assembly in parliamentary groups and parliamentary committees. The constitutional court, as it has already had the opportunity to substantiate its view in its acts, does not deals with possible violations of this nature.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "ROLE/SCOPE OF THE COURT"
    },
    {
        "paragraph_id": 36,
        "text": "Due to the above and on the grounds of Art. 149, para. 1, item 2 of the Constitution The Constitutional Court RESOLVED: Rejects the request of 50 MPs from the 36th National Assembly for declaring the decision of the National Assembly unconstitutional by July 15, 1992 on the application for granting the status of a higher school to the so-called Varna Free University.",
        "label": "DECISION",
        "label_id": 5,
        "description": "CASE RESOLVED"
    }
]
