[
    {
        "paragraph_id": 1,
        "text": "Solution Ne 5 of 6 April 1993 under c.d. Ne 6/93 for interpretation of Art. 68, para. 1 of the Constitution on incompatibility between the position of an MP and the performance of another civil service or activity (Promulgated, SG No. 31 of 13 April 1993)",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "CASE TITLE"
    },
    {
        "paragraph_id": 2,
        "text": "Members: Asen Manov - Chairman, Mladen Danailov, Tsanko Hadjistoychev, Stanislav Dimitrov, Neno Nenovski - Rapporteur, Nikolay Pavlov, Teodor Chipev, Milena Zhabinska, Lyuben Kornezov, Pencho Penev, Alexander Arabadjiev",
        "label": "BACKGROUND",
        "label_id": 0,
        "description": "CASE TITLE"
    },
    {
        "paragraph_id": 3,
        "text": "The proceedings were instituted at the request of 52 MPs from the 36th National Assembly for mandatory interpretation of Art. 65, para. 2 and Art. 68, para. 1 of the Constitution.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 4,
        "text": "By order of 2 March 1993, the Constitutional Court granted her request constitutes parties to the case - the National Assembly, the Council of Ministers, parliamentary groups.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 5,
        "text": "The authors of the request were instructed to clarify the issues which, in their view, should be interpreted.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 6,
        "text": "Opinions with clarifications and reasons were also submitted by the submitters of the request.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "REFERRAL"
    },
    {
        "paragraph_id": 7,
        "text": "The Constitutional Court found the following: The request raises two questions: \"1. Should it be considered that the mandatory provision of art. 65, para 2 \"Candidates for Members of Parliament who hold public office shall suspend its implementation after its registration\", shall be applied also in the cases in which after the election and assumption of duties by the MPs have begun work in different varieties of the state structure?",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "QUESTIONS RAISED"
    },
    {

        "paragraph_id": 8,
        "text": "2. Taking into account the provision of art. 68, para. 1 \"MPs do not may perform another civil service or carry out an activity which according to the law it is incompatible with the position of an MP\", Does its prohibition regime include activities such as: paid participation in a management, supervisory (control) board in a company with a state or municipal participation; paid participation in a bank formation with state participation; paid participation in a government commission or other government formation?\"",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "QUESTIONS RAISED"
    },
    {
        "paragraph_id": 9,
        "text": "The first question asks whether Art. 65, para. 2 shall be applied also in the cases in which and after the election and assumption of duties by the MPs have begun work in the system of the state apparatus.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "SCOPE"
    },
    {
        "paragraph_id": 10,
        "text": "From the literal text of the provision sees that its addressees are only candidates for MPs who occupy public office, not already elected MPs who are entered into the performance of their duties.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 11,
        "text": "For the latter, Art. 68, para. 1. Compliance with the requirement under Art. 65, para. 2 aims to ensure equality in the election campaign of the candidates for Members of Parliament. This requirement cannot apply to persons who are already members of parliament.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "INTENTION OF EXISTING LAW"
    },
    {
        "paragraph_id": 12,
        "text": "Themselves the authors of the request, in their observations of 12 March 1993, stated that in both the question posed by them seeks an interpretation of Art. 68, para. 1 of the Constitution.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 13,
        "text": "When this situation, the Constitutional Court held that it had to give an answer to the second issue related to Art. 68, para. 1.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "EXISTING LAW"
    },
    {
        "paragraph_id": 14,
        "text": "I. The provision of art. 68, para. 1 of the Constitution establishes the institute of the incompatibility between the functions of the Member of Parliament and other functions in the state apparatus and beyond. The provisions of Art. 72, para. 1, item 3 and para. 2 of the Constitution, which regulate the consequences of non-observance of the prohibitions under Art. 68, para. 1.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 15,
        "text": "The main purpose of incompatibility is to ensure the independence of MPs, the legislature in general, by creating safeguards against unacceptable effects by other forces external to the legislature - state or non - state your character.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "PURPOSE OF INCOMPATIBILITY"
    },
    {
        "paragraph_id": 16,
        "text": "By protecting the people's representation, the incompatibility defends the interests of society as a whole.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "DEFENDING SOCIETY'S INTERESTS"
    },
    {
        "paragraph_id": 17,
        "text": "Along with this incompatibility must be a guarantee for the regular presence and participation of the Member of Parliament in the work of parliament.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "GUARANTEEING PRESENCE AND PARTICIPATION"
    },
    {
        "paragraph_id": 18,
        "text": "In Art. 68, para. 1, two types of incompatibility have been established, resp. two prohibitions that must not be mixed: a ban on MPs to perform another civil service; ban on MPs from carrying out activities, which according to the law is incompatible with the position of a Member of Parliament.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "TYPES OF INCOMPATIBILITY"
    },
    {
        "paragraph_id": 19,
        "text": "The two prohibitions refer to precisely defined and different factual compositions.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 20,
        "text": "Incompatibility is a unity of factual and legal elements.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INCOMPATIBILITY"
    },
    {
        "paragraph_id": 21,
        "text": "To be finds incompatibility, it is necessary to establish a correspondence between certain facts and the hypothesis of one of the two prohibition rules, forming the content of art. 68, para. 1.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "LEGAL BACKGROUND/CONTEXT"
    },
    {
        "paragraph_id": 22,
        "text": "Without this approach, one cannot answer the issues raised in the request, in particular whether they fall under the prohibitions of the constitutional framework the functions (activities) specified in the request and if fall, under which exact ban.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INTERPRETING EXISTING LAW RELATED TO CASE"
    },
    {
        "paragraph_id": 23,
        "text": "IL. The first ban excludes the possibility for MPs to perform another civil service.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "NATURE OF BAN"
    },
    {
        "paragraph_id": 24,
        "text": "This is a ban on simultaneous exercise of deputy mandate and service in the state apparatus (public function in general).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "NATURE OF BAN"
    },
    {
        "paragraph_id": 25,
        "text": "In the constitutional development of states this kind of incompatibility is historical occurred at the earliest.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "REASON FOR RULING"
    },
    {
        "paragraph_id": 26,
        "text": "The prohibition in this case must ensure compliance with the principle of separation of powers (Article 8 of the Constitution).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SCOPE OF BAN"
    },
    {
        "paragraph_id": 27,
        "text": "The more direct goal, however consists in preventing possible unauthorized interference with the executive in the field of the legislature.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "THE FUNCTION AND IMPORTANCE OF SEPARATION OF POWERS"
    },
    {
        "paragraph_id": 28,
        "text": "He is an MP representative of his constituents and of the whole people and to be able to perform their functions in their interest on the basis of the Constitution and laws and c in accordance with his conscience and conviction, he must be free from all commitment, first of all by official commitment. And the official commitment in most cases can be combined with material commitment.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "MP'S ROLE"
    },
    {
        "paragraph_id": 29,
        "text": "Powers of the National Assembly to exercise legislative power and to exercise parliamentary control will not be able to be exercised effectively if its members are dependent on the executive.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "THE FUNCTION AND IMPORTANCE OF SEPARATION OF POWERS"
    },
    {
        "paragraph_id": 30,
        "text": "Of decisive importance in this first hypothesis of incompatibility is the meaning, p which is used in Art. 68, para. 1 the term \"civil service\".",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 31,
        "text": "In principle, the term \"civil service\" is used in administrative law, where it is associated with public administration and public administration, ie. s the functions of the executive.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 32,
        "text": "Except in the narrow sense as the implementation of administrative, managerial functions in state institutions (institutions of budget support), it is understood more broadly - it also covers the structures of the state administration through which the executive exercises its functions in relation to public property.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 33,
        "text": "But we are talking about civil service and civil servants (for some of their types) with specific content in other branches of law.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 34,
        "text": "That is why in the absence of an unambiguous doctrinal or legal definition of civil service the meaning and content of the concept in the individual cases must be revealed in accordance with the specific objectives of the regulations and the institutes with which it is connects.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 35,
        "text": "In the Constitution, except in Art. 68, para. 1 for civil service is also spoken in art. 65, para. 2. The concept is the basis of the provision of Art. 116.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "USE OF CIVIL SERVICE IN THE CONSTITUTION"
    },
    {
        "paragraph_id": 36,
        "text": "Undoubtedly the concept \"civil service\" must be understood in a uniform and consistent sense. The most in general, this is an activity to perform the functions of the state. This activity is carried out on behalf of the state and to exercise the powers of its bodies provided for in the Constitution. It is provided for and usually is receives remuneration. This is not an activity directly related to the production of material values",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 37,
        "text": "This most general meaning of the term however, \"civil service\" does not exclude the particularities by which it is used in Constitution and which it acquires depending on its specific systematically place and by the respective legal institute with which it is directly related.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "DEFINING CIVIL SERVICE"
    },
    {
        "paragraph_id": 38,
        "text": "Not possible for example, to have an absolute coincidence in scope of the concept in Art. 68, para. 1 and Art. 16. (The discrepancy in terms of volume does not mean a contradiction in the general meaning of the concept, it expresses only the differences between the types of state service.) the logical and systematic interpretation of the two texts leads to the conclusion, that in Art. 116 refers to only one type of civil service - in the field of the executive, the state administration in the proper sense of the word.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LIMITATIONS AND SCOPE OF GENERAL DEFINITION OF CIVIL SERVICE"
    },
    {
        "paragraph_id": 39,
        "text": "While in Art. 68, para. 1 refers to a wider scope of the concept. The functional concept of \"civil service\" in Art. 68, para. 1 of the Constitution is inseparable from the institute of incompatibility, from its constitutional purpose.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "FUNCTIONAL CONCEPT OF CIVIL SERVICE"
    },
    {
        "paragraph_id": 40,
        "text": "In support of this broad understanding is the wording of Art. 68, para. 1. According to the text of the provision, MPs cannot perform \"other\" civil service.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "MEMBERS OF PARLIAMENT & CIVIL SERVICE"
    },
    {
        "paragraph_id": 41,
        "text": "This means that for civil service in this case accepts and performs the functions of the legislature, as prohibits the performance of \"another\", ie any state outside it service. The ban applies to all types of civil service and civil service employees in the state apparatus in general.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "MEMBERS OF PARLIAMENT & CIVIL SERVICE"
    },
    {
        "paragraph_id": 42,
        "text": "The conclusion is that the provision of Art. 68, para. 1 of the Constitution creates a ban on MPs to perform any functions of the state (without view of their subject and form) outside the sphere of legislative power.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 43,
        "text": "The ban applies both to service in public institutions and to \"the diverse in subject of activity and way of organization\", as well as to the service in the management of public enterprises (state and municipal).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 44,
        "text": "These enterprises manage state and municipal property (public property within the meaning of Art. 17, para. 2 of the Constitution) and therefore their government is a public function which takes the legal form of a civil service in the most general constitutional meaning. It does not matter the legal form in which it is organized public enterprise - state company, trade company with state property, etc.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 45,
        "text": "IIL. The second prohibition under Art. 68, para. 1 of the Constitution does not allow the people representatives to carry out an activity which, according to the law, is incompatible with the position of an MP.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "SCOPE OF THE BAN"
    },
    {
        "paragraph_id": 46,
        "text": "While the first ban (or the first kind incompatibility) refers to the functions of the state and its bodies, it the second prohibition (or the second type of incompatibility) refers to another, mainly private activity.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SECOND TYPE OF INCOMPATIBILITY"
    },
    {
        "paragraph_id": 47,
        "text": "The only criterion (negative) for outlining this an activity that can be drawn from the text of the provision is that it is about activity that is not a civil service.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 48,
        "text": "The logical interpretation of leads us to this Art. 68, para. 1. As soon as the first prohibition refers to the civil service in the broadest sense its meaning, it means that it means an activity related to realization of public functions and powers of state bodies.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 49,
        "text": "For the second ban the sphere remains outside the state. And because this area is unusually wide and covers a wide variety of people's activities, the constitutional legislator is considered that the specific type of activity, which is incompatible with the status of the Member of Parliament must be appointed by law.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "WIDER SCOPE OF SECOND BAN"
    },
    {
        "paragraph_id": 50,
        "text": "In view of the objective pursued by establishing the incompatibility of parliamentary mandate and other service or work, historical experience has shown that the independence of the people's representation is really threatened by unification in one person of the public (state) power and of the economic one power.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "RISK POSED TO POLITICAL INSTITUTIONS AND STABILITY"
    },
    {
        "paragraph_id": 51,
        "text": "In such cases, the interest of the state usually suffers. Its possible development of corruption in the state apparatus, the prestige of parliament is threatened.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "THREAT TO PARLIAMENT'S PRESTIGE"
    },
    {
        "paragraph_id": 52,
        "text": "Therefore, the most common ban on carrying out activities from MP in the private sphere has in mind some of the economic activities which give particularly strong economic power and which can make dependent certain units of the state apparatus (in this case Parliament and its bodies), if he is involved with them and is personally involved the holder of the deputy mandate is interested.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "RISK POSED TO POLITICAL INSTITUTIONS AND STABILITY"
    },
    {
        "paragraph_id": 53,
        "text": "These kinds of activities are subordinate of the requirements of private law and this is one of the signs on which it can the second prohibition under Art. 68, para. 1 in contrast to the first ban, which is refers to activities subject exclusively to the requirements of the public right.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "DEFINING CIVIL SERVICE IN WIDER SCOPE"
    },
    {
        "paragraph_id": 54,
        "text": "We have not yet adopted a law defining which activities are incompatible with the position of an MP, who at the same time do not constitute civil service.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "MP'S ROLE AND CIVIL SERVICE"
    },
    {
        "paragraph_id": 55,
        "text": "This is one of the obligations of the National Assembly under ยง 3, para. 3 of the transitional and final provisions of the Constitution.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "NATIONAL ASSEMBLY OBLIGATIONS"
    },
    {
        "paragraph_id": 56,
        "text": "Until the adoption of law only the rules of civil morality and ethics of the parliamentarian can to influence.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "NEED FOR LEGAL DECISION/RULING"
    },
    {
        "paragraph_id": 57,
        "text": "In order to establish such incompatibility, applying Art. 72, para. 2, item 3 in connection with Art. 68, para. 1 of the Constitution, a law is needed which determines the activity excluded from the second prohibition of Art. 68, para. 1.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "NEED FOR A LAW"
    },
    {
        "paragraph_id": 58,
        "text": "While the first prohibition under Art. 68, para. 1 has direct applicability by virtue of Art. 5, para. 2 of The Constitution, the second prohibition is bound by additional legislation.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 59,
        "text": "It can be contained in several pieces of legislation. The direct action of the second prohibition is possible together with a law that determines which activities are incompatible with the position of an MP.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "SCOPE & PLACE/CONTEXT OF DECISION"
    },
    {
        "paragraph_id": 60,
        "text": "The unequivocal wording of Art. 68, para. 1 does not allow another interpretation.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 61,
        "text": "(In connection with this it may be finds that Art. 96, para. 1 of the Regulations for organization and activity of The National Assembly is in contradiction with the explicit text of Art. 68, para. 1 of The Constitution.)",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 62,
        "text": "Of course, the direct applicability of the ban on borrowing another civil service does not exclude the possibility of designation by law of state services (or activities having the character of a civil service) which MPs cannot perform.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SCOPE OF EXISTING LAW"
    },
    {
        "paragraph_id": 63,
        "text": "IV. In their request to the Constitutional Court, the MPs ask to give an interpretation of Art. 68, para. 1 of the Constitution in view of the applicability of its prohibitions on specific ones, not homogeneous in its legal nature characteristic activities: participation in a government commission or other government formation; participation in the bodies of enterprises, companies and others with state or municipal property; participation in bank formation with state capital.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP'S REQUEST"
    },
    {
        "paragraph_id": 64,
        "text": "The first type of activity mentioned in the request consists in participating in various government bodies - commissions, councils, agencies and other structures.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "MP'S REQUEST"
    },
    {
        "paragraph_id": 65,
        "text": "These structures are part of the state apparatus in the narrow sense of the word (state institutions), established by the supreme and central body of the executive power with managerial (or organically related) functions assigned to them and powers.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "INSTITUTIONAL STRUCTURES"
    },
    {
        "paragraph_id": 66,
        "text": "Therefore, the combination of parliamentary mandate with work in such authorities is prohibited by the provision of Art. 68, para. 1. This also applies to authorities (commissions, centers, institutes, etc.) subordinated to ministries and others administration institutions.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "CATEGORIZATION OF INSTITUTIONS"
    },
    {
        "paragraph_id": 67,
        "text": "The application of the ban presupposes a specific approach in each individual case.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SCOPE OF EXISTING LAW"
    },
    {
        "paragraph_id": 68,
        "text": "The reason and spirit of the ban to take another civil service require to the marked bodies should not refer to various commissions, councils, etc., which are not part of the relevant government (departmental) administration and have a clean advisory and advisory functions (eg temporary commissions of scientists and other specialists to cover a certain issue, etc.)",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "APPLICATION OF LAW"
    },
    {
        "paragraph_id": 69,
        "text": "The second type of activity, specified in the request is the participation in the bodies of enterprises, companies, commercial companies that manage state and municipal property.",
        "label": "SUMMARY",
        "label_id": 1,
        "description": "MP'S REQUEST"
    },
    {
        "paragraph_id": 70,
        "text": "Although the activity of these enterprises, companies, companies is carried out in accordance with private law, their governing apparatus is subordinate to the executive - is appointed, controlled and dismissed.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": null
    },
    {
        "paragraph_id": 71,
        "text": "The management function and their management reflects and realizes the public interest with which it is connected and the role of the state. In this sense, it is also a public function and a state one service.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "LEGAL BACKGROUND"
    },
    {
        "paragraph_id": 72,
        "text": "The management apparatus of the indicated public legal entities is a specific part of the state apparatus as a whole, which is being built and whose structures interact in principle in accordance with public law.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 73,
        "text": "Such an interpretation finds support in the norms of the Constitution itself, which apply to the economic activity of the state and to the powers of the executive power in economics (especially Articles 18 and 106).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": null
    },
    {
        "paragraph_id": 74,
        "text": "It is also supported by legal norms (Art. 61 and 62 of the Commercial Code, as well as ยง 2 of the transitional and final provisions of the same law; Art. 1 of the Law for formation of sole proprietorships with state property; Law on Transformation and Privatization of State and municipal enterprises).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL NORMS"
    },
    {
        "paragraph_id": 75,
        "text": "In fulfillment of its power under Art. 106 of the Constitution to \"organize management of state property\", as well as its powers, determined by law, the Council of Ministers has issued several decrees.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "BACKGROUND"
    },
    {
        "paragraph_id": 76,
        "text": "With them are regulated in detail the management of state property, the exercise by the Council of Ministers of his right to be the holder of the state capital in commercial companies.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "BACKGROUND"
    },
    {
        "paragraph_id": 77,
        "text": "It is especially characteristic in this respect Decree Ne 265 of 28 December 1992 (SG, issue 4 of 1993) Based on these regulations the Council of Ministers, ministers and chairmen of committees of the Council of Ministers have issued numerous orders and decisions on the management system and on the appointment and dismissal of the staff of the management and control bodies (supervisory and management boards, boards of directors, etc.) of commercial companies with state property.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "BACKGROUND"
    },
    {
        "paragraph_id": 78,
        "text": "All this legislation leaves no doubt that the members of the governing bodies of the various state-owned enterprises, companies, commercial companies with state and municipal property are included in the system of the state apparatus, the executive in particular.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "ROLE PLAYED BY MEMBERS"
    },
    {
        "paragraph_id": 79,
        "text": "Without such organs and without their and their members' official dependence on the government would not could exercise its rights and obligations in connection with the management of state property, which are determined by the Constitution.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "ROLE PLAYED BY MEMBERS"
    },
    {
        "paragraph_id": 80,
        "text": "The fact that after the issuance of legal acts appointing the members of supervisory, management and other boards are concluded a contract between them and the relevant executive body does not change the nature of the function that those bodies perform and the service that their members perform.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "SCOPE OF EXISTING LAW"
    },
    {
        "paragraph_id": 81,
        "text": "There is a public office and a civil service. Contracts called in the normative acts \"management contracts\" determine the specifics of the fundamentally public nature of the relations between the managers (management) bodies of state enterprises and public legal persons, on the one hand, and government bodies, on the other.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 82,
        "text": "The contracts specify the activity that will be carried out, the remuneration that will be received, in general, the rights and obligations, but does not delete the public law relationships and dependencies in the case. Legal relationships arise from complex legal factual composition - administrative act and contract.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL SCOPE"
    },
    {
        "paragraph_id": 83,
        "text": "The administrative act is decisive. The conclusion is that the provision of Art. 68, para. 1 of the Constitution prohibits simultaneous performance of deputy functions and functions in supervisory, control, management and other bodies of companies and trade companies with state property in cases where the management system and the bodies of management of these economic (state and municipal) organizations is determined non-autonomously, but with acts of state power.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 2,
        "description": "REASONING"
    },
    {
        "paragraph_id": 84,
        "text": "It is true that concluding a contract for management of a commercial company with state participation, the people's representative shall not become a civil servant within the meaning of Art. 116 of he Constitution, as he does not hold a position in the state administration.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "REASONING"
    },
    {
        "paragraph_id": 85,
        "text": "But he performs civil service within the meaning of Art. 68, para. 1 of the Constitution, since enters into public relations - and they are relations not unilateral dependence - with executive authority.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "REASONING"
    },
    {
        "paragraph_id": 86,
        "text": "At the heart of the relationship as a legal fact is the individual act of the executive state body. It is a prerequisite of contract.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL BASIS FOR DECISION"
    },
    {
        "paragraph_id": 87,
        "text": "The contract itself is concluded with an executive body (Council of Ministers, ministers, etc.) and its purpose is to settle functions of the executive power in the management and administration of the state property (Article 106 of the Constitution).",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL BASIS FOR DECISION"
    },
    {
        "paragraph_id": 88,
        "text": "The contractual form gives specificity and features of the nature of the assigned functions, but does not change it.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL BASIS FOR DECISION"
    },
    {
        "paragraph_id": 89,
        "text": "The essential thing is that the functions are a manifestation and realization of the powers of the executive branch.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "EXECUTIVE POWERS"
    },
    {
        "paragraph_id": 90,
        "text": "From this point of view and in view of those stated in the request activities it can be said that the prohibition under Art. 68, para. 1 (the first hypothesis or the first ground for incompatibility) includes a ban on popular representatives to perform executive functions on the basis of management contract.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "REASONING"
    },
    {
        "paragraph_id": 91,
        "text": "The third type of activity for which an interpretation must be given as to whether it is covered by any of the prohibitions under Art. 68, para. 1 of the Constitution, is the participation in banks with state property (state capital). Because there are different legal status banks, distinctions are needed.",
        "label": "FACTUAL",
        "label_id": 2,
        "description": "BACKGROUND"
    },
    {
        "paragraph_id": 92,
        "text": "The Bulgarian National Bank (referred to in regulations as the central bank) undoubtedly possesses the features of a state institution, conducts state policy, its bodies are elected, resp. appointed by the National Assembly and by President of the Republic and have state powers in the relevant field of public relations.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "STATE INSTITUTIONS"
    },
    {
        "paragraph_id": 93,
        "text": "Therefore, there can be no dispute, that MPs cannot hold public office in this bank.",
        "label": "POLITICAL",
        "label_id": 4,
        "description": "POLITICAL REASONING"
    },
    {
        "paragraph_id": 94,
        "text": "In confirmation of this is the provision of Art. 14 of the Bulgarian Law National Bank.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LEGAL JUSTIFICATION"
    },
    {
        "paragraph_id": 95,
        "text": "The question must be answered in the same way regarding participation in the bodies of the State Savings Bank and the State Savings Bank insurance institute. In all these cases the first prohibition of art. 68, para. 1.",
        "label": "FACTUAL",
        "label_id": 3,
        "description": "BACKGROUND"
    },
    {
        "paragraph_id": 96,
        "text": "As for the other types of banks whose bodies (advice of directors or supervisory boards) are not formed by acts of the state, they are outside the effect of the first prohibition under Art. 68, para. 1. There is no implementation of civil service as long as the members of these bodies are not appointed under administrative route.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "LIMITATIONS OF RULING"
    },
    {
        "paragraph_id": 97,
        "text": "Participation in them may be declared incompatible with the position of a Member of Parliament by law. Then it can be the second prohibition under Art. 68, para. 1. As indicated, a similar law yet not accepted.",
        "label": "CONSTITUTIONAL INTERPRETATION",
        "label_id": 3,
        "description": "REASONING"
    },
    {
        "paragraph_id": 98,
        "text": "For the stated reasons and on the grounds of art. 149, para. 1, item | of the Constitution The Constitutional Court RESOLVED: MPs may not perform functions such as: (a) members of government commissions, councils, agencies, centers and the like state structures; b) members of bodies of state and municipal enterprises, companies, commercial companies with state and municipal property, assigned to them by acts (orders, orders, decisions) of executive bodies and related management contracts.",
        "label": "DECISION",
        "label_id": 5,
        "description": "RESOLUTION"
    }
]
