[
    {
        "paragraph_id": 1,
        "text": "JUDGMENT № 8 Sofia, 8 October 2002 constitutional case № 7/2002 Judge-Rapporteur Dimitar Gochev (Promulgated, SG No. 97 of 15 October 2002)",
        "label": "BACKGROUND",
        "label_id": 0
    },
    {
        "paragraph_id": 2,
        "text": "Members: Hristo Danov - Chairman, Dimitar Gochev - Rapporteur, Todor Todorov, Nedelcho Beronov, Stefanka Stoyanova, Margarita Zlatareva, Vasil Gotsev, Lyudmil Neykov, Rumen Yankov, Zhivan Belchev, Penka Tomcheva",
        "label": "BACKGROUND",
        "label_id": 0
    },
    {
        "paragraph_id": 3,
        "text": "The case was instituted on April 12, 2002 at the request of the President of the Republic of Bulgaria to establish the unconstitutionality of Article 33, paragraph 5 of the Personal Income Tax Act (PITA) - new, promulgated, SG, no. 110 of 2001",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 4,
        "text": "The request alleges that the attacked text contradicts Article 60, paragraph 1 and paragraph 2 and Article 84, item 3 of the Constitution of the Republic of Bulgaria.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 5,
        "text": "The term “gross area of ​​the respective site”, used in the text and expressing the tax base, was not defined in the additional provisions of the law. In addition, the \"gross area of ​​the respective site\" is an element of property tax and is inadmissibly used to determine the amount of income tax, such as the patent tax.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 6,
        "text": "By order of 21 May 2002, the Constitutional Court granted the application on the merits.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 7,
        "text": "The National Assembly, the Council of Ministers, the Minister of Finance, the National Audit Office, the Bulgarian Chamber of Crafts, the Bulgarian Chamber of Commerce and Industry and the Bulgarian Chamber of Commerce constituted as interested parties in the case. Interested parties were given the opportunity to make their views known in writing.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 8,
        "text": "By letter dated 31 May 2002, the National Assembly sent its opinion, prepared and adopted by the Committee on Budget and Finance.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 9,
        "text": "The Council of Ministers sent its opinion by letter dated 20 June 2002, the Minister of Finance by letter dated 11 June 2002.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 10,
        "text": "These three statements support the thesis that the impugned text does not contradict the basic law. It is pointed out that the final patent tax is not tied to the amount of income received from the tax debtor, but to the implementation of the activity referred to in the law. The final annual patent tax is a direct income tax, but its amount is determined not on the basis of real, but on estimated income. \"Square meter gross area\" is an indicator related to the expected income, as it takes into account the scale of the respective activity from which the income is realized.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 11,
        "text": "The observations of the Bulgarian Chamber of Commerce and Industry - sent by letter dated 5 June 2002, to the Bulgarian Chamber of Commerce - letter dated 4 June 2002, support the arguments set out in the request - for the unconstitutionality of the impugned text. It is pointed out that the concept of \"gross area of ​​the respective site\" is not clarified by law and this violates the requirement by law to determine all elements of the tax.",
        "label": "SUMMARY",
        "label_id": 1
    },
    {
        "paragraph_id": 12,
        "text": "In an additional opinion of 5 June 2002, the President of the Republic of Bulgaria stated that the impugned text contradicted the constitutional principle of fairness in determining tax liabilities because the introduction of an additional tax related to gross area violated the principle of relative equality of tax subjects. This criterion has nothing to do with the criterion \"functional type of settlement\", which is the basis of the organization of patent taxation.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 13,
        "text": "By letter of 4 June 2002, the Bulgarian Chamber of Crafts also upheld the request, arguing that the additional criterion introduced by the impugned text concerned a property tax which the patent tax was not.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 14,
        "text": "The Constitutional Court, considering the considerations set forth in the request of the President of the Republic of Bulgaria, as well as the opinions of the parties involved, in order to rule, took into account the following:",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 15,
        "text": "The taxes shall be established and their amount shall be determined by the National Assembly, in accordance with Article 84, item 3 of the Constitution of the Republic of Bulgaria. Moreover, tax liabilities can be determined only by law, as indicated in Article 60, paragraph 1 of the Basic Law.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 16,
        "text": "This constitutional principle is also indicated in the decisions of the Constitutional Court № 3 under c.d. № 2 of 1996 and № 6 under c.d. № 4 of 1998",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 17,
        "text": "The Constitution defines two categories of taxes - according to whether they are based on the property of taxable persons or on the basis of their income (Article 60, paragraph 1). As accepted by the Constitutional Court in Decision № 9 under c.d. № 9 of 1996 it is inadmissible to use the elements that determine the amount of taxes of one category in determining the amount of the other category of taxes.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 18,
        "text": "The attacked provision of Art. 33, item 5 of the Income Tax Act determines an additional amount of the due patent tax by the persons performing activities under Art. 31, item 6, letters “a” and “b”, item 7, b. “A”, “b”, “c”, “e”, “k”, “l”, “m”, “c”, “x”, “щ” and “ю”, as to the basic size adds BGN 5 per square meter of gross area for the respective site.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 19,
        "text": "The basic final annual (patent) tax according to the provision of art. 31 of the Income Tax Act is determined in the amount of a fixed amount depending on the type of activity performed by the taxable subject, respective categorization of the activity (object), functional type of settlements, zones, number jobs and other indicators.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 20,
        "text": "The general characteristic for determining the amount of the final annual (patent) tax is that they are an indication of the intensity of the respective activity and hence - presumed, expected income.",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 21,
        "text": "The amount of the used area for carrying out the respective activity is connected with a precondition for the possible turnover (volume of performed activity) and hence higher or lower income.",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 22,
        "text": "This indicator obviously refers to the respective income and is used precisely to determine the amount of an income tax, such as the final annual (patent) tax.",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 23,
        "text": "The term “gross area for the respective site”, used by the legislator as a determination of the tax base for the additional amount of the annual (patent) tax, is not really defined in an additional provision of the law, as it is done with the term “net commercial area” in § 1, item 18 of the additional provisions of SITA. However, the Court finds that this does not violate the constitutional requirement of Art. 60, para 1 and 2 and Art. 84, item 3 that taxes be determined by the National Assembly, and by law (see also Decision № 3 of CC under Code of Civil Procedure № 2 of 1996), including all their elements.",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 24,
        "text": "The lack of a definition of the term by which the legislator determines the tax base does not mean that the base is not determined by law. If in the application of the law there is a need to clarify the concept of \"gross area of ​​the site\", this concept can be interpreted. (Such an interpretation should not create a problem in the presence of the definition in § 1, item 18 of the additional provisions of the Income Tax Act of the term “net commercial area”.)",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 25,
        "text": "The term used (“gross area of ​​the respective object”) for determining the additional amount of the patent tax is not an element of property tax. The gross area on which the activities under Art. 31 and Art. 32 of the Income Tax Act are carried out is used, as indicated, as a measure of the volume of the respective activity, and not as an indication of the value of property owned by the taxable person.",
        "label": "CONSTITUTIONAL.INTERPRETATION",
        "label_id": 3
    },
    {
        "paragraph_id": 26,
        "text": "The Constitutional Court held that the principle of a fair amount of taxes, enshrined in Article 61, paragraph 1 of the Constitution, was not violated.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 27,
        "text": "With the attacked text the legislator has determined an additional amount of income tax in accordance with its competence under Article 84, item 3 and in accordance with the requirements of Article 60, paragraphs 1 and 2 of the Constitution.",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 28,
        "text": "Therefore, the Constitutional Court finds that the provision of Article 33, paragraph 5 of the Income Tax Act does not contradict the Basic Law of the Republic of Bulgaria, therefore on the grounds of Article 149, paragraph 1, item 2 of the Constitution of the Republic of Bulgaria and Art. 14, para 2 of the Constitutional Court Act",
        "label": "FACTUAL",
        "label_id": 2
    },
    {
        "paragraph_id": 29,
        "text": "RESOLVED: Rejects the request of the President of the Republic of Bulgaria to establish the unconstitutionality of Article 33, paragraph 5 of the Personal Income Tax Act - new, promulgated, SG No. 110/2001.",
        "label": "DECISION",
        "label_id": 5
    }
]
